Tekla Open API Reference for Tekla Structures 2025
MeshCatalog Class
 The MeshCatalog class represents a group of controls to select meshes using the mesh catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.MeshCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class MeshCatalog : UserControl
Public Class MeshCatalog
	Inherits UserControl
The MeshCatalog type exposes the following members.
Constructors
Name | Description
MeshCatalog
 Initiates a new instance of the control.
Top
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedMeshGrade
 The mesh grade in the control.
SelectedMeshName
 The mesh name in the control.
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace